<%@ page contentType="text/html;charset=UTF-8" language="java" %>
<ul class="collection">
    <li class="collection-item">
        Вбудовані бібліотеки тегів: JSP має вбудовані бібліотеки тегів, такі як JSTL (JavaServer Pages Standard Tag Library), які дозволяють виокремити логіку з відображення і полегшити роботу з даними та контролем потоку.
    </li>
    <li class="collection-item">
        Повторне використання компонентів: JSP дозволяє створювати шаблони та компоненти, які можна повторно використовувати на різних сторінках веб-додатка.
    </li>
    <li class="collection-item">
        Обробка форм: JSP добре підходить для обробки форм на стороні клієнта. Ви можете легко отримувати дані від користувача та виконувати перевірку введених даних.
    </li>
    <li class="collection-item">
        Інтеграція з Java-фреймворками: JSP можна легко інтегрувати з різними Java-фреймворками, такими як Spring, для розробки веб-додатків.
    </li>
    <li class="collection-item">
        Підтримка сесій: JSP підтримує роботу зі сесіями, що дозволяє зберігати стан між різними HTTP-запитами.
    </li>
    <li class="collection-item">
        Локалізація: JSP має можливості для локалізації, що дозволяє створювати веб-сторінки, які відображаються в різних мовах та регіонах.
    </li>
    <li class="collection-item">
        Підтримка технології Servlet: JSP базується на технології Servlet, що дозволяє легко інтегрувати JSP-сторінки з іншими Servlet-компонентами в веб-додатку.
    </li>
    <li class="collection-item">
        Динамічні змінні: JSP дозволяє створювати та використовувати динамічні змінні, які можна вставляти в HTML-сторінку.
    </li>
    <li class="collection-item">
        Підтримка стилів та скриптів: Ви можете легко вставляти CSS-стилі та JavaScript-скрипти в JSP-сторінки для поліпшення відображення та інтерактивності.
    </li>
    <li class="collection-item">
        Підтримка роботи з базами даних: JSP дозволяє взаємодіяти з базами даних, виконуючи запити та оброблюючи результати.
    </li>
    <li class="collection-item">
        Інтеграція з серверами додатків: JSP-сторінки можуть легко використовуватися на серверах додатків, таких як Apache Tomcat, для створення повноцінних веб-додатків.
    </li>
</ul>